Паттерн декоратор позволяет динамически добавлять новый функционал к нашему объекту
при помощи реализации общего интерфейса (обертки) и это бесконечный процесс, то есть мы
каждый раз реализуем какую-то структуру этого интерфейса и добавляем какой-то функционал, и соответственно,
это бесконечный процесс.

Допустим, у нас есть какая-то нотификация, у нас есть много различных приложений, каких-то соцсетей и нам нужно объединить нотификацию,
то есть мы можем создать какой-то обощенный интерфейс нотификации и оборачивать различные API к этому обобщенному интерфейсу.

Либо пример, когда у нас есть много одежды и мы надеваем на себя ее. (или разные виды одежды надеваем поверх другой)


ЧЕ КОДИМ:
//Предположим, у нас есть сеть, которая занимается продажей компьютеров, напишем программу, которая будет динамически изменять цену,
//при добавлении каких-то свойств. (ну то есть допустим, у нас есть компьютер - базовая комплектация, и при добавлении или изменении этой базовой комплектации
//тем самым, стоимость должна увеличиваться.