Компоновщик - это структурный паттерн в проектировании, он позволяет создавать древовидную структуру объектов и работать как-будто мы работаем
с одним элементом.
Он часто используется когда у нас есть возможность создать структуру в виде дерева, где каждое звено представляет собой какую-то абстрактную
модель поведения и, соответственно, каждое звено будет иметь общий интерфейс.

Допустим, у нас есть структура файлововй директории, где файл - компонент и директория - тоже компонент и, соответственно, можно настроить так
чтобы искать файлы внутри директорий при помощи обобщенного интерфейса компонента.

Основное преимущество паттерна - это упрощение архитектуры, с точки зрения обобщенного интерфейса и добавление новых
видов компонентов значительно проще чем в обычной, но с другой стороны, минус - это как раз, мы создаем очень обобщенный интерфейс нашего
проекта, то есть у нас один интерфейс распространяется на большое количество структур, и это минус, потому что мы привязаны к этому
интерфейсу.
